app/controllers/houses_controller.rb

  def index
    #consinder houses as a list or an array and use for loop to iterate through it
    if params[:category].blank?
---
SELECT "categories".* FROM "categories"

  def new
    @house = current_user.houses.build
    @categories = Category.all.map{|c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"

  def create
    @house = current_user.houses.build(house_params)
    @house.category_id = params[:category_id]

    if @house.save
---
INSERT INTO "houses" ("address", "size", "room", "bathroom", "postal_code", "price", "created_at", "updated_at", "description", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)